_posts/2015-04-10-mail-relocation.html
---
published: true
comments: yes
layout: post
title: Mail relocation
tags: [mail]
category: [odoo, module]
---

<p>
Odoo has a good integration with email. It allows to have a discussion
with a customer attached to some record (task, lead, invoice etc.).
</p>

<p>
In the main, your customer don't know about this and can send emails
(e.g. about a task) to your personal alias
(e.g. admin@yourcompany). It could not be a problem, if you work on
task alone. But if you need to share email to colleagues, it's better
to move (attach) mail to task form. I've made module
<code>mail_move_message</code> to do it.
</p>

<p>
Technically, the module update fields <code>res_id</code> and <code>model</code> of
<code>mail.message</code> modules. It also, keep original values to allow to move
everything back.
</p>

<p>
A usage guide with screenshots can be found here: <a href="https://apps.odoo.com/apps/modules/8.0/mail_move_message/">https://apps.odoo.com/apps/modules/8.0/mail_move_message/</a>
</p>

<p>
It's not mentioned in module's description, but if you move a message,
then all messages in a thread below the message would also be moved
to a new location.
</p>

<p>
Repository: <a href="https://github.com/yelizariev/addons-yelizariev/tree/8.0/mail_move_message">https://github.com/yelizariev/addons-yelizariev/tree/8.0/mail_move_message</a>
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Uninstalling</h2>
<div class="outline-text-2" id="text-1">
<p>
Please note, that after uninstalling the module, all infromation
about original location of moved messages will be lost.
</p>
</div>
</div>
